#include <iostream>
#include <string>
#include <vector>
//#include <windows.h>
#include <conio.h>

using namespace std;

//
//void main()
//{
//	Program::menu();
//}

/*
---ИНФОРМАЦИЯ---
1. Информация об академии
- Название
- Город
- Адрес
- Количество групп
- Количество студентов
- Количество работников
- Инфо о директоре
2. Вывести список групп (дизайнеры / программисты / админы на выбор)
3. Вывести информацию о группе (поиск по названию)
- Название
- Текущий предмет
- Количество студентов
- Преподаватель
- Средний балл по группе
- Средняя посещаемость по группе
4. Вывести информацию о студентах в группе (поиск по названию)
- Фамилия
- Имя
- Возраст
- Средний балл
- Процент посещаемости
- Телефон
- Email
5. Вывести список сотрудников
- Фамилия
- Имя
- Возраст
- Зарплата
- Стаж (в днях)
- Список навыков (у преподавателей)
- Количество контрактов (у консультантов)
- Рейтинг (у директора)
- Телефон
- Email
6. Рейтинг студентов академии
- Студент с лучшей посещаемостью
- Студент с лучшей успеваемостью
- Группа с лучшей посещаемостью
- Группа с лучшей успеваемостью
7. Рейтинг сотрудников академии
- Сотрудник с самой высокой зарплатой
- Сотрудник с самым большим стажем
- Преподаватель с наибольшим количеством групп
---РЕДАКТИРОВАНИЕ---
1. Студенты
- Добавить студента
- Редактировать студента
- Удалить студента
2. Сотрудники
- Добавить сотрудника
- Редактировать сотрудника
- Удалить сотрудника
3. Группы
- Добавить группу
- Редактировать группу
- Удалить группу
---УПРАВЛЕНИЕ---
1. Показать доходы и расходы академии
- За месяц
- За семестр
- За год
2. Изменить стоимость обучения в академии
3. Повысить / понизить зарплату всем сотрудниками на n%
4. Сменить директора академии
---ВЫХОД---
*/